10/data/attachments/8771e480f14b9502.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_13104b59-5eae-48e4-b3f4-b08c7f84fd6e</nif:username>
            <nif:friendToBeAdded>Marcus_late_Friend_99885_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>